# Task 1 :- 
**How to read random rows from our data**

In [1]:
import pandas as pd

In [11]:
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
        'Age':[27, 24, 22, 32, 15],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th']}

In [12]:
df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
4   Geeku   15      Noida          10th

## Method 1 :-

In [4]:
df.sample()

  Name  Age Address Qualification
0  Jai   27   Delhi           Msc

## Method 2 :-

In [5]:
# To get 3 random rows , each time it gives 3 different rows

df.sample(n = 3)

    Name  Age  Address Qualification
0    Jai   27    Delhi           Msc
4  Geeku   15    Noida          10th
3   Anuj   32  Kannauj           Phd

In [6]:
# OR

df.sample(3)

     Name  Age    Address Qualification
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
4   Geeku   15      Noida          10th

## Method 3 :-

In [7]:
# Fraction of rows , here you get .50 % of the rows
# Number of rows = 5 ==> half of it = 2

df.sample(frac = 0.5)

   Name  Age  Address Qualification
0   Jai   27    Delhi           Msc
3  Anuj   32  Kannauj           Phd

In [8]:
# OR , here you get 70 % row from the df

df.sample(frac =.7)

     Name  Age  Address Qualification
3    Anuj   32  Kannauj           Phd
0     Jai   27    Delhi           Msc
4   Geeku   15    Noida          10th
1  Princi   24   Kanpur            MA

## Method 4 :-

In [9]:
# Dataframe df has only 5 rows , if we try to select more than 5 row then will come error
# Cannot take a larger sample than population when 'replace = False'

df.sample(n = 3, replace = False)

     Name  Age    Address Qualification
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
4   Geeku   15      Noida          10th

In [10]:
# Select more than rows with using replace , default it is False

df.sample(n = 6, replace = True)

     Name  Age  Address Qualification
4   Geeku   15    Noida          10th
3    Anuj   32  Kannauj           Phd
0     Jai   27    Delhi           Msc
0     Jai   27    Delhi           Msc
1  Princi   24   Kanpur            MA
3    Anuj   32  Kannauj           Phd

## Method 5 :-

In [11]:
# Weights will be re-normalized automatically

test_weights = [0.1, 0.1, 0.2, 0.2, 0.4]
 
df.sample(n = 3, weights = test_weights)

     Name  Age    Address Qualification
3    Anuj   32    Kannauj           Phd
4   Geeku   15      Noida          10th
2  Gaurav   22  Allahabad           MCA

## Method 6 :-

In [12]:
# Accepts axis number or name.

df.sample(axis = 0)

  Name  Age Address Qualification
0  Jai   27   Delhi           Msc

In [13]:
# sample also allows users to sample columns instead of rows.

df.sample(axis = 1)

   Age
0   27
1   24
2   22
3   32
4   15

## Method 7 :-

In [14]:
# With a given seed, the sample will always draw the same rows.
# Random State object is returned.

df.sample(n = 2, random_state = 2)

     Name  Age    Address Qualification
2  Gaurav   22  Allahabad           MCA
4   Geeku   15      Noida          10th

In [15]:
# If random_state is None the sample will not draw the same rows.

df.sample(n = 2, random_state = None)

     Name  Age    Address Qualification
4   Geeku   15      Noida          10th
2  Gaurav   22  Allahabad           MCA

## Method 8 :-

In [16]:
import numpy as np
import pandas as pd

In [23]:
# Dataframe df has only 5 rows , if we try to select more than 5 row then will come error
# Cannot take a larger sample than population when 'replace = False'

row_indexs = np.random.choice(5, replace = False, size = 4)
df1 = df.iloc[row_indexs]
df1

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
1  Princi   24     Kanpur            MA

In [24]:
# Select more than rows with using replace , default it is False

row_indexs = np.random.choice(4, replace = True, size = 6)
df1 = df.iloc[row_indexs]
df1

     Name  Age    Address Qualification
2  Gaurav   22  Allahabad           MCA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
1  Princi   24     Kanpur            MA
0     Jai   27      Delhi           Msc
0     Jai   27      Delhi           Msc

# Task 2 :-
**How to append to an existing csv file, excel file same sheet**

In [19]:
import pandas as pd

In [20]:
# Step 1: View Existing CSV File

df = pd.read_csv("Task 2.csv")
df

  Team  Points  Rebounds
0    A       5        11
1    A       7         8
2    B       9         6
3    B      12         6
4    C       9         5

In [21]:
# Step 2: Create New Data to Append

df = pd.DataFrame({'team': ['D', 'D', 'E', 'E'],
                   'points': [6, 4, 4, 7],
                   'rebounds': [15, 18, 9, 12]})
df

  team  points  rebounds
0    D       6        15
1    D       4        18
2    E       4         9
3    E       7        12

In [22]:
# Step 3: Append New Data to Existing CSV

df.to_csv('Task 2.csv', mode='a', index=False, header=False)

# Task 3 :-
**Replace data in csv file ( interpolate )**

## case 1 : 32, NAN, NAN, NAN, 30

In [31]:
import pandas as pd

In [32]:
df = pd.read_excel("Task 3.xlsx","case 1")
df

         Day  Temperature
0 2017-01-01         32.0
1 2017-01-04          NaN
2 2017-01-05          NaN
3 2017-01-06          NaN
4 2017-01-07         30.0

In [33]:
df1 = df.interpolate()
df1

         Day  Temperature
0 2017-01-01         32.0
1 2017-01-04         31.5
2 2017-01-05         31.0
3 2017-01-06         30.5
4 2017-01-07         30.0

## case 2 : 32, 30, NAN , NAN , NAN

In [34]:
import pandas as pd

In [35]:
df = pd.read_excel("Task 3.xlsx","case 2")
df

         Day  Temperature
0 2017-01-01         32.0
1 2017-01-04         30.0
2 2017-01-05          NaN
3 2017-01-06          NaN
4 2017-01-07          NaN

In [36]:
df2 = df.interpolate()
df2

         Day  Temperature
0 2017-01-01         32.0
1 2017-01-04         30.0
2 2017-01-05         30.0
3 2017-01-06         30.0
4 2017-01-07         30.0

## case 3 : 32, 30, NAN , NAN , NAN , 31

In [37]:
import pandas as pd

In [38]:
df = pd.read_excel("Task 3.xlsx","case 3")
df

         Day  Temperature
0 2017-01-01         32.0
1 2017-01-04         30.0
2 2017-01-05          NaN
3 2017-01-06          NaN
4 2017-01-07          NaN
5 2017-01-08         31.0

In [39]:
df3 = df.interpolate()
df3

         Day  Temperature
0 2017-01-01        32.00
1 2017-01-04        30.00
2 2017-01-05        30.25
3 2017-01-06        30.50
4 2017-01-07        30.75
5 2017-01-08        31.00

# Task 4 :-
**Replace data in specific columns with specific values**

In [1]:
import pandas as pd

In [26]:
data = {'Name':['Ahmed', 'Ali', 'Omar', '70'],
        'Age':[23, 20, 70, 70]}

In [42]:
df = pd.DataFrame(data)
df

# Replace:- ( Name : Ahmed --> ahmed ) , ( Age : 70 --> 17 )

    Name  Age
0  Ahmed   23
1    Ali   20
2   Omar   70
3     70   70

## Method 1 :-

In [44]:
df1 = df.replace({ 'Ahmed' : 'ahmed' , 70 : 17 })
df1

    Name  Age
0  ahmed   23
1    Ali   20
2   Omar   17
3     70   17

## Method 2 :-

In [29]:
df2 = df.replace({ 'Ahmed' : 'ahmed' , '70' : 17 })
df2

    Name  Age
0  ahmed   23
1    Ali   20
2   Omar   70
3     17   70

## Method 3 :-

In [45]:
df.replace({'Name':{'Ahmed':'ahmed'},'Age':{70:17}})

    Name  Age
0  ahmed   23
1    Ali   20
2   Omar   17
3     70   17

## Method 4 :-

In [41]:
df["Name"].replace({'Ahmed':'ahmed'}, inplace=True)
df["Age"].replace({70:17}, inplace=True)
df

    Name  Age
0  ahmed   23
1    Ali   20
2   Omar   17
3     70   17

# Task 5 :-
**How to combine more than 2 dataframes at the same time**

In [3]:
import pandas as pd

In [4]:
data1 = {
        'id': ['1', '2', '3', '4', '5'],
        'Feature1': ['A', 'C', 'E', 'G', 'I'],
        'Feature2': ['B', 'D', 'F', 'H', 'J']}

In [5]:
df1 = pd.DataFrame(data1, columns = ['id', 'Feature1', 'Feature2'])
df1

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

In [6]:
data2 = {
        'id': ['1', '2', '6', '7', '8'],
        'Feature1': ['K', 'M', 'O', 'Q', 'S'],
        'Feature2': ['L', 'N', 'P', 'R', 'T']}

In [7]:
df2 = pd.DataFrame(data2, columns = ['id', 'Feature1', 'Feature2'])
df2

  id Feature1 Feature2
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [8]:
data3 = {
        'id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'Feature3': [12, 13, 14, 15, 16, 17, 15, 12, 13, 23]}

In [9]:
df3 = pd.DataFrame(data3, columns = ['id', 'Feature3'])
df3

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [10]:
data_frames = [df1, df2, df3]

## Method 1 :-

In [12]:
from functools import reduce

In [14]:
df_merged = reduce(lambda left,right : pd.merge(left,right,on=['id'],how='outer'), data_frames)
df_merged

    id Feature1_x Feature2_x Feature1_y Feature2_y  Feature3
0    1          A          B          K          L      12.0
1    2          C          D          M          N      13.0
2    3          E          F        NaN        NaN      14.0
3    4          G          H        NaN        NaN      15.0
4    5          I          J        NaN        NaN      16.0
5    6        NaN        NaN          O          P       NaN
6    7        NaN        NaN          Q          R      17.0
7    8        NaN        NaN          S          T      15.0
8    9        NaN        NaN        NaN        NaN      12.0
9   10        NaN        NaN        NaN        NaN      13.0
10  11        NaN        NaN        NaN        NaN      23.0

## Methode 2 :-

In [11]:
pd.concat(data_frames, ignore_index=True)

    id Feature1 Feature2  Feature3
0    1        A        B       NaN
1    2        C        D       NaN
2    3        E        F       NaN
3    4        G        H       NaN
4    5        I        J       NaN
5    1        K        L       NaN
6    2        M        N       NaN
7    6        O        P       NaN
8    7        Q        R       NaN
9    8        S        T       NaN
10   1      NaN      NaN      12.0
11   2      NaN      NaN      13.0
12   3      NaN      NaN      14.0
13   4      NaN      NaN      15.0
14   5      NaN      NaN      16.0
15   7      NaN      NaN      17.0
16   8      NaN      NaN      15.0
17   9      NaN      NaN      12.0
18  10      NaN      NaN      13.0
19  11      NaN      NaN      23.0